Revit 2024 API
EndTreatmentType.Create Method (Document)
 Creates a new EndTreatmentType in a document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static EndTreatmentType Create(
	Document doc
)
Visual Basic
Public Shared Function Create ( _
	doc As Document _
) As EndTreatmentType
Visual C++
public:
static EndTreatmentType^ Create(
	Document^ doc
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
EndTreatmentType Class
Create Overload
Autodesk.Revit.DB.Structure Namespace